Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_pwr.h
/**
  ******************************************************************************
  * @file    py32e407_ll_pwr.h
  * @author  MCU Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32E407_LL_PWR_H
#define PY32E407_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx.h"

/** @addtogroup PY32E407_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */
/** @defgroup PWR_LL_EC_WAKEUP_HSION_MODE WAKEUP HSI ON MODE
  * @{
  */
#define LL_PWR_STOPWAKEUP_HSION_AFTER_MR       0x00000000U         /* Wake up from the STOP mode, After the MR becomes stable, enable HSI */
#define LL_PWR_STOPWAKEUP_HSION_IMMEDIATE      PWR_CR1_HSION_CTRL  /* Wake up from the STOP mode, Enable HSI immediately */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PROGRAMMA_FLASH_DELAY WAKEUP PROGRAMMA FLASH DELAY
  * @{
  */          
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_3US      (0x00000000U)                              /* Wake up from the STOP mode, Delay 3us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_5US      (                     PWR_CR1_FLS_WUPT_0)  /* Wake up from the STOP mode, Delay 5us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_2US      (PWR_CR1_FLS_WUPT_1                     )  /* Wake up from the STOP mode, Delay 2us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_0US      (PWR_CR1_FLS_WUPT_1 | PWR_CR1_FLS_WUPT_0)  /* Wake up from the STOP mode, Delay 0us enable flash*/
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_STANDBY_MRREAD_DELAY WAKEUP STANDBY MRREAD DELAY
  * @{
  */          
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_3US      (0x00000000U)                                             /* Wake up from the STANDBY mode, MR ready wait 3us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_5US      (                             PWR_CR1_STDBY_MRRDY_WAIT_0) /* Wake up from the STANDBY mode, MR ready wait 5us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_10US     (PWR_CR1_STDBY_MRRDY_WAIT_1                             ) /* Wake up from the STANDBY mode, MR ready wait 10us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_20US     (PWR_CR1_STDBY_MRRDY_WAIT_1 | PWR_CR1_STDBY_MRRDY_WAIT_0) /* Wake up from the STANDBY mode, MR ready wait 20us*/
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SELECT_VR_OUTPUT_VOLTAGE_LEVEL SELECT VR OUTPUT VOLTAGE LEVEL
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_SCALE1               0x00000000U          /* High voltage.      */
#define LL_PWR_REGU_VOLTAGE_SCALE2               PWR_CR1_VOS_0        /* Medium voltage     */
#define LL_PWR_REGU_VOLTAGE_SCALE3               PWR_CR1_VOS_1        /* Mddium low voltage */
#define LL_PWR_REGU_VOLTAGE_SCALE4               PWR_CR1_VOS          /* Low voltage        */

#define LL_PWR_REGU_VOLTAGE_HIGH                 LL_PWR_REGU_VOLTAGE_SCALE1
#define LL_PWR_REGU_VOLTAGE_MEDIUM               LL_PWR_REGU_VOLTAGE_SCALE2
#define LL_PWR_REGU_VOLTAGE_MEDIUM_LOW           LL_PWR_REGU_VOLTAGE_SCALE3
#define LL_PWR_REGU_VOLTAGE_LOW                  LL_PWR_REGU_VOLTAGE_SCALE4

/**
  * @}
  */

/** @defgroup PWR_LL_EC_CONTROL_SRAM2_VOLTAGE_IN_STANDBY CONTROL SRAM2 VOLTAGE IN STANDBY MODE
  * @{
  */          
#define LL_PWR_SRAM2_VOLTAGE_HIGH                0x00000000U          /* High voltage.      */
#define LL_PWR_SRAM2_VOLTAGE_MEDIUM              PWR_CR1_SRAM_RETV_0  /* Medium voltage     */
#define LL_PWR_SRAM2_VOLTAGE_MEDIUM_LOW          PWR_CR1_SRAM_RETV_1  /* Mddium low voltage */
#define LL_PWR_SRAM2_VOLTAGE_LOW                 PWR_CR1_SRAM_RETV    /* Low voltage        */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_SCR_CSBF                    PWR_SCR_CSBF
#define LL_PWR_SCR_CWUF                    PWR_SCR_CWUF
#define LL_PWR_SCR_CWUF5                   PWR_SCR_CWUF5
#define LL_PWR_SCR_CWUF4                   PWR_SCR_CWUF4
#define LL_PWR_SCR_CWUF3                   PWR_SCR_CWUF3
#define LL_PWR_SCR_CWUF2                   PWR_SCR_CWUF2
#define LL_PWR_SCR_CWUF1                   PWR_SCR_CWUF1
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_SR_PVDO                     PWR_SR_PVDO
#define LL_PWR_SR_MR_RDY                   PWR_SR_MR_RDY
#define LL_PWR_SR_SBF                      PWR_SR_SBF
#define LL_PWR_SR_WUF                      PWR_SR_WUF
#define LL_PWR_SR_EWUP1                    PWR_SR_WUF1
#define LL_PWR_SR_EWUP2                    PWR_SR_WUF2
#define LL_PWR_SR_EWUP3                    PWR_SR_WUF3
#define LL_PWR_SR_EWUP4                    PWR_SR_WUF4
#define LL_PWR_SR_EWUP5                    PWR_SR_WUF5
/**
  * @}
  */

/** @defgroup PWR_LL_EC_MODE_PWR MODE PWR
  * @{
  */
#define LL_PWR_MODE_STOP0                  (0x00000000U)  /*!< Stop0:   Work in MR mode  */
#define LL_PWR_MODE_STOP1                  PWR_CR1_LPMS_0 /*!< Stop1:   Work in LPR mode */
#define LL_PWR_MODE_STANDBY                PWR_CR1_LPMS   /*!< Standby: VR close mode    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDLEVEL Power Voltage Detector Level
  * @{
  */
/* #define LL_PWR_PVDLEVEL_0                  (PWR_CR2_PLS_LEV0) */     /*!< Voltage threshold detected by PVD 1.8 V */
/* #define LL_PWR_PVDLEVEL_1                  (PWR_CR2_PLS_LEV1) */     /*!< Voltage threshold detected by PVD 2.0 V */
/* #define LL_PWR_PVDLEVEL_2                  (PWR_CR2_PLS_LEV2) */     /*!< Voltage threshold detected by PVD 2.2 V */
#define LL_PWR_PVDLEVEL_3                  (PWR_CR2_PLS_LEV3)      /*!< Voltage threshold detected by PVD 2.4 V */
#define LL_PWR_PVDLEVEL_4                  (PWR_CR2_PLS_LEV4)      /*!< Voltage threshold detected by PVD 2.6 V */
#define LL_PWR_PVDLEVEL_5                  (PWR_CR2_PLS_LEV5)      /*!< Voltage threshold detected by PVD 2.8 V */
#define LL_PWR_PVDLEVEL_6                  (PWR_CR2_PLS_LEV6)      /*!< Voltage threshold detected by PVD 3.0 V */
#define LL_PWR_PVDLEVEL_7                  (PWR_CR2_PLS_LEV7)      /*!< Voltage threshold detected by extern IO input */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDFILTER PVDFILTER
  * @{
  */
#define LL_PWR_PVD_FILTER_1CLOCK          (0x00000000u)                                                   /*!< PVD filter 1    clock */
#define LL_PWR_PVD_FILTER_2CLOCK          (                                          PWR_CR2_FLT_CTRL_0)  /*!< PVD filter 2    clock */
#define LL_PWR_PVD_FILTER_4CLOCK          (                     PWR_CR2_FLT_CTRL_1                     )  /*!< PVD filter 4    clock */
#define LL_PWR_PVD_FILTER_16CLOCK         (                     PWR_CR2_FLT_CTRL_1 | PWR_CR2_FLT_CTRL_0)  /*!< PVD filter 16   clock */
#define LL_PWR_PVD_FILTER_64CLOCK         (PWR_CR2_FLT_CTRL_2                                          )  /*!< PVD filter 64   clock */
#define LL_PWR_PVD_FILTER_128CLOCK        (PWR_CR2_FLT_CTRL_2                      | PWR_CR2_FLT_CTRL_0)  /*!< PVD filter 128  clock */
#define LL_PWR_PVD_FILTER_1024CLOCK       (PWR_CR2_FLT_CTRL_2 | PWR_CR2_FLT_CTRL_1                     )  /*!< PVD filter 1024 clock */
/**
  * @}
  */

